org/web/Google.org
* Googleを利用しよう

** アカウントの作成

- 大学のメールが読めることを確認しておきましょう。
- http://google.com へいきましょう。
- 大学のメールアドレスを使って登録しましょう。

Googleにスパム扱いされないように入力ミスなく，一回で登録できるよ
うにしましょう。

- [[http://itnow.blog.jp/archives/1021508835.html][Gmailの携帯番号認証を回避して登録する方法６つ]]

- 携帯のメールアドレスを聞かれるのは，本人確認のためで，問題ないようで
  す。

** Gmail を使ってみよう
- http://google.com へいきましょう。
- Gmail サービスを探しましょう。
  Google アプリ （３ｘ３の□）で見つかります。
- ログインして自分のメールボックスをチェックしてみましょう。

** Google Drive
*** って何？
http://google.com が提供しているファイル保存・共有サービス http://drive.google.com
- 15GB まで無料
- ブラウザから利用できる
- パソコン，スマホそれぞれのためのアプリがある
  - パソコンとスマホの間でファイルをやり取りできる

*** 講義で使う目的
- レポートの提出場所
- 自分の文書保管場所

*** 作り方

- Google にアカウントを作成し，
- Gmail でメールが受け取れるようにしましょう
- GoogleDrive に行って，上で作ったアカウントを使って，登録します。
- 登録完了すれば使えます。

*** 使い方

- WebブラウザでGoogleを開き，ログインします。
- GoogleDriveを開きます。
- Windows のフォルダのように自然につかえます。

*** 情報処理フォルダの作成

- 自分の GoogleDrive に情報処理フォルダを作成しましょう。
- そのフォルダを開き，ブックマークしてください。
- 盛大PCの情報処理演習フォルダの中身を、コピーしてみましょう。

*** レポート提出フォルダの作成

- 自分の GoogleDrive に名前が， 「情報処理レポート提出じぶんの学生番号」のフォ
  ルダを作成し，
 
- そのフォルダを右クリックし，共有設定を行なってください:
  - リンクを知っている全員が閲覧可
  - ユーザに suzumasa054@gmail.com を指定してください。

- そのフォルダを開き，ブックマークしてください。

*** スマホのアプリを使ってみる

- GoogleDrive アプリを持っていなければダウンロードしましょう。

- 自分のドライブを使ってみましょう。

* 自分の GoogleDrive ができていない人は

** 先生が用意したフォルダ

クラス毎に，下記の先生の GoogleDrive のフォルダを使ってください:
   
- B組 :: 
   https://drive.google.com/open?id=0B11Iwlj2EHvvbDBzcEpzNjQyc28

- A組 :: 
  https://drive.google.com/open?id=0B11Iwlj2EHvvOGFOcmR6U0p5c0U

** 先生が用意したフォルダに自分のレポート提出フォルダを作成する

- 上記サイトを開き，
- 「ドライブ」ボタンをクリックし，GoogleDrive アプリを起動する。
- 「新期」ボタンをクリックして，フォルダを作成し，
- フォルダの名前を「情報処理レポート提出じぶんの学生番号」としてください。
- そのフォルダを開き，ブックマークしてください。
- また，そのフォルダで右クリックし，
- 「共有」を選び，共有設定を行います:
  - リンクを知っている全員が閲覧可
  - ユーザに suzumasa054@gmail.com を指定してください。

