docs/google.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>情報処理応用 Google</title>
<!-- 2016-09-28 水 13:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="suzumasa@morioka-u.ac.jp" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://nat054.ddo.jp/~masayuki/org-html-theme/styles/sos/css/sos.css">
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">情報処理応用 Google</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Googleを利用しよう</a>
<ul>
<li><a href="#sec-1-1">1.1. アカウントの作成</a></li>
<li><a href="#sec-1-2">1.2. Gmail を使ってみよう</a></li>
<li><a href="#sec-1-3">1.3. Google Drive</a>
<ul>
<li><a href="#sec-1-3-1">って何？</a></li>
<li><a href="#sec-1-3-2">講義で使う目的</a></li>
<li><a href="#sec-1-3-3">作り方</a></li>
<li><a href="#sec-1-3-4">使い方</a></li>
<li><a href="#sec-1-3-5">情報処理フォルダの作成</a></li>
<li><a href="#sec-1-3-6">レポート提出フォルダの作成</a></li>
<li><a href="#sec-1-3-7">スマホのアプリを使ってみる</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. 自分の GoogleDrive ができていない人は</a>
<ul>
<li><a href="#sec-2-1">2.1. 先生が用意したフォルダ</a></li>
<li><a href="#sec-2-2">2.2. 先生が用意したフォルダに自分のレポート提出フォルダを作成する</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="http://masayuki054.github.io/morioka_u_ict">情報処理応用ホーム</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Googleを利用しよう</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> アカウントの作成</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>大学のメールが読めることを確認しておきましょう。
</li>
<li><a href="http://google.com">http://google.com</a> へいきましょう。
</li>
<li>大学のメールアドレスを使って登録しましょう。
</li>
</ul>

<p>
Googleにスパム扱いされないように入力ミスなく，一回で登録できるよ
うにしましょう。
</p>

<ul class="org-ul">
<li><a href="http://itnow.blog.jp/archives/1021508835.html">Gmailの携帯番号認証を回避して登録する方法６つ</a>
</li>

<li>携帯のメールアドレスを聞かれるのは，本人確認のためで，問題ないようで
す。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Gmail を使ってみよう</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="http://google.com">http://google.com</a> へいきましょう。
</li>
<li>Gmail サービスを探しましょう。
Google アプリ （３ｘ３の□）で見つかります。
</li>
<li>ログインして自分のメールボックスをチェックしてみましょう。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Google Drive</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">って何？</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
<a href="http://google.com">http://google.com</a> が提供しているファイル保存・共有サービス <a href="http://drive.google.com">http://drive.google.com</a>
</p>
<ul class="org-ul">
<li>15GB まで無料
</li>
<li>ブラウザから利用できる
</li>
<li>パソコン，スマホそれぞれのためのアプリがある
<ul class="org-ul">
<li>パソコンとスマホの間でファイルをやり取りできる
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">講義で使う目的</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>レポートの提出場所
</li>
<li>自分の文書保管場所
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3">作り方</h4>
<div class="outline-text-4" id="text-1-3-3">
<ul class="org-ul">
<li>Google にアカウントを作成し，
</li>
<li>Gmail でメールが受け取れるようにしましょう
</li>
<li>GoogleDrive に行って，上で作ったアカウントを使って，登録します。
</li>
<li>登録完了すれば使えます。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4">使い方</h4>
<div class="outline-text-4" id="text-1-3-4">
<ul class="org-ul">
<li>WebブラウザでGoogleを開き，ログインします。
</li>
<li>GoogleDriveを開きます。
</li>
<li>Windows のフォルダのように自然につかえます。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3-5" class="outline-4">
<h4 id="sec-1-3-5">情報処理フォルダの作成</h4>
<div class="outline-text-4" id="text-1-3-5">
<ul class="org-ul">
<li>自分の GoogleDrive に情報処理フォルダを作成しましょう。
</li>
<li>そのフォルダを開き，ブックマークしてください。
</li>
<li>盛大PCの情報処理演習フォルダの中身を、コピーしてみましょう。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3-6" class="outline-4">
<h4 id="sec-1-3-6">レポート提出フォルダの作成</h4>
<div class="outline-text-4" id="text-1-3-6">
<ul class="org-ul">
<li>自分の GoogleDrive に名前が， 「情報処理レポート提出じぶんの学生番号」のフォ
ルダを作成し，
</li>

<li>そのフォルダを右クリックし，共有設定を行なってください:
<ul class="org-ul">
<li>リンクを知っている全員が閲覧可
</li>
<li>ユーザに suzumasa054@gmail.com を指定してください。
</li>
</ul>
</li>

<li>そのフォルダを開き，ブックマークしてください。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3-7" class="outline-4">
<h4 id="sec-1-3-7">スマホのアプリを使ってみる</h4>
<div class="outline-text-4" id="text-1-3-7">
<ul class="org-ul">
<li>GoogleDrive アプリを持っていなければダウンロードしましょう。
</li>

<li>自分のドライブを使ってみましょう。
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 自分の GoogleDrive ができていない人は</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 先生が用意したフォルダ</h3>
<div class="outline-text-3" id="text-2-1">
<p>
クラス毎に，下記の先生の GoogleDrive のフォルダを使ってください:
</p>

<dl class="org-dl">
<dt> B組 </dt><dd>   <a href="https://drive.google.com/open?id=0B11Iwlj2EHvvbDBzcEpzNjQyc28">https://drive.google.com/open?id=0B11Iwlj2EHvvbDBzcEpzNjQyc28</a>
</dd>

<dt> A組 </dt><dd>  <a href="https://drive.google.com/open?id=0B11Iwlj2EHvvOGFOcmR6U0p5c0U">https://drive.google.com/open?id=0B11Iwlj2EHvvOGFOcmR6U0p5c0U</a>
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 先生が用意したフォルダに自分のレポート提出フォルダを作成する</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>上記サイトを開き，
</li>
<li>「ドライブ」ボタンをクリックし，GoogleDrive アプリを起動する。
</li>
<li>「新期」ボタンをクリックして，フォルダを作成し，
</li>
<li>フォルダの名前を「情報処理レポート提出じぶんの学生番号」としてください。
</li>
<li>そのフォルダを開き，ブックマークしてください。
</li>
<li>また，そのフォルダで右クリックし，
</li>
<li>「共有」を選び，共有設定を行います:
<ul class="org-ul">
<li>リンクを知っている全員が閲覧可
</li>
<li>ユーザに suzumasa054@gmail.com を指定してください。
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzumasa@morioka-u.ac.jp</p>
<p class="date">Created: 2016-09-28 水 13:01</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
